{
    "ACCOUNT": "Account",
    "ACCOUNT_FROM": "Account From",
    "ACCOUNT_TO": "Account To",
    "ALL": "All",
    "AMOUNT": "Amount",
    "ANY_EQUALS": "Any equals",
    "ASSET": "Asset",
    "ASSET_TRANSFER": "Asset transfer",
    "CONTAINS": "Contains",
    "CSV": "CSV",
    "CURRENCY": "Currency",
    "CUSTOM": "Custom",
    "Check.the.table": "Check the table below to know more about the available tokens. The example column use the date '2014-08-06T13:07:04.054' considered as a local time in America/New_York.",
    "DESCRIPTION": "Description",
    "DETAILS": "Details",
    "EQUALS": "Equals",
    "OPENING": "Opening",
    "Opening": "Opening",
    "OPENING_NEGATIVE": "Negative opening balance",
    "OPENING_POSITIVE": "Positive opening balance",
    "EXPENSE": "Expense",
    "FROM_EQUALS": "From equals",
    "GREATER_THAN": "Greater than",
    "IN": "In",
    "INCOME": "Income",
    "ISO_CODE": "ISO Code",
    "LESS_THAN": "Less than",
    "LIABILITY": "Liabitlity",
    "LIABILITY_DECREASE": "Liability decrease",
    "LIABILITY_INCREASE": "Liability increase",
    "LIABILITY_TRANSFER": "Liability transfer",
    "NAME": "Name",
    "NONE": "None",
    "OUT": "Out",
    "SPREADSHEET": "Spreadsheet",
    "SYMBOL": "Symbol",
    "TO_EQUALS": "To equals",
    "TRANSACTION_TYPE": "Transaction type",
    "edit": {
        "filter": {
            "in": {
                "rule": "Edit filter..."
            }
        }
    },
    "pick.your.default.currency": "First, let's select your language and your default currency.",
    "rate.dont.exist": "Rate from {fromCurrency} to {toCurrency} doesn't exist. Click here to create one.",
    "en": "English",
    "fr": "Français",
    "documentation": {
        "concept": {
            "1": "Accounts in Cashcash are buckets in which money goes in and out. It is used to describe your bank account, your loan, your current cash but it can also describe something often defined as \"categories\" in other finance apps like your salary, your tax, your grocery expenses.",
            "2": "All your accounts fit into 5 types:",
            "3": "Income: What you earn",
            "4": "Expense: What you spend",
            "5": "Asset: What you own",
            "6": "Liability: What you owe",
            "7": "Opening: Initial amount use to set up your asset accounts",
            "8": "\"Asset\", \"Liability\" and \"Opening\" describe money that is closely related to your current situation, therefore, we call them the \"internal\" accounts. The \"Income\" and \"Expense\" accounts describe money that is coming from and going to the outside world. They don't define what is your current situation and therefore we call them external accounts.",
            "9": "The \"internal\" accounts (\"Asset\", \"Liability\", \"Opening\") must have a specific currency. In other words, a transaction involving these accounts has to respect this specified currency.",
            "10": "To organize and group accounts together, you can put them in folders and create a tree of accounts. This is useful when you want to see transactions from several accounts at the same time in a graph or if you want to budget a group of accounts. A folder can't itself be part of a transaction.",
            "11": "A transaction is a transfer of money from one account to another. The account from which the money leaves is called the \"from account\". The account in which the money arrives is called the \"to account\".",
            "12": "Each transaction has a type. It defines what accounts are allowed in the \"from account\" and \"to account\". All the types available are materialized with the arrows you see in the accounts schema in the above section.",
            "13": "Most transactions will be a transfer of money in one currency but you can also choose to do it with a currency change. It means X amount from a certain currency will leave the \"from account\" and Y amount in another currency will arrive in the \"to account\".",
            "14": "You can define an \"Import Id\" on a transaction to be able to detect duplicate during a bulk transaction import. If no \"Import Id\" is present, Casshcash will try to detect duplicates by matching description, amount and date.",
            "15": "Here is a list of the available currencies in Cashcash:",
            "16": "You can define manually the exchange rate of each of them in the \"rate\" page (see the walkthrough section of the documentation). This exchange rate is used to properly show transactions in graphs.",
            "17": "Filters can be used everywhere in the app to filter the transactions you want to see. It is useful to show a graph with only specific transactions. It can also be used to find a single transaction in your list. You are able to save the filter in the database so that you reuse it later or so that you can create rules based on it (Pro version only).",
            "18": "A rule is a filter + an action. A filter is described in the above section. An action is something that modifies the transaction itself. The goal of a rule is to automate the assignment of all the known transactions. A rule can be applied during a bulk transaction import or in a single transaction edit.",
            "19": "It worth noting that a rule can be wrong. For example, it can change the account of a transaction and make it incompatible with the current transaction type. Don't worry, you won't be able to save this transaction and the error message will guide you."
        },
        "walkthrough": {
            "1": "The home page is the page you get when you open the app. It contains 2 sections:",
            "2": "Flow bar graph: It shows for the each account type, the 9 accounts with the biggest transfert of money. The other accounts are groupedunder the name \"Remaining accounts...\" on the graph. It is useful to graspquickly how balanced you are and what are your main expense/income accounts.",
            "3": "Activity heatmap: It shows how many transactions and how much amount you did per day. This is mainly useful after applying a transaction filter to notice pattern or missing value in your transaction history.",
            "4": "Note that the transaction filter and the time selector in the top are applied.",
            "5": "This is the page to go to view and manage your internal accounts (\"Asset\", \"Liability\" and \"Opening\"). The tree on the left side let you navigate among your accounts and select one. The panel on the right illustrate the status of the selected account. Here is a brief description of each graph present in the panel:",
            "6": "Cumulative line chart: It shows the evolution of the value of the account during the time range.",
            "7": "In/out bar chart: It shows for each month, the amount that is leaving the account and the amount that is entering the account. This one is really useful to see if you are balanced month by month.",
            "8": "In/out pie chart: This chart shows the repartion of the amount per account during this time range.",
            "9": "Note that the transaction filter and the time selector in the top are applied.",
            "10": "This is the page to go to view and manage your external accounts (\"Income\" and \"Expense\"). It provides functionnalities similar to what is described in \"Internal accounts page\" section however the graph provided are slightly differents:",
            "11": "Flow bar graph: It shows for each month the repartion of amount per account.",
            "12": "In/out pie chart: see \"internal accounts page\" section for more details.",
            "13": "This page lets you explore all your transactions. This is where you search/edit/delete them. Note that the transaction filter and the time selector in the top are applied.",
            "14": "This page lets you define the exchange rate between currencies.",
            "15": "This page is here to define the budget of your asset accounts. In short, you can define what you're expecting to go 'in' the account and 'out' of the account. For this you need to create budget entries. They are similar to transactions in terms of the concept except that you can only create 2 budget entries between 2 accounts: One for each direction.",
            "16": "The budget is compared with your current transactions which are split in 2 groups: the transactions that are made on budgeted accounts connections and those which are not.",
            "17": "On the right side, you will see a delta table for the budget. This is meant to help you realize what is the difference between your 'out' budget and your 'in' budget. For example, if you have an 'in' budget of 100$ and an 'out' budget of 80$, it means you could spend an extra 20$ for this month if you follow your budget thoroughly.",
            "18": "Note that the transaction filter and the time selector in the top are applied to your transactions but not to the budget values so you need to be mindful in the analysis of the data in this case.",
            "19": "This page list all the filter you created. You manage them and run them from here.",
            "20": "This page list all the rules you created. You manage them here. The rule can be applied when editing a transaction or when doing a bulk import.",
            "21": "This page list all the import configuration you created. You manage them here and you can start importing a file here. You can import transactions from CSV, XLS, XLSX and ODS files. In order to test your configuration without messing with your actual transaction data, you can click on the `Erlenmeyer` icon in the top left corner when editing a config.",
            "22": "Note on the spreadsheet type (XLS, XLSX and ODS): In order to sucessfully import transactions from a spreadsheet, the table containing the transaction has start at the first cell (A1 adress) of the first sheet of the file. Be aware also that the date could be imported in a different format that the one you see if it's not a pure string. In other word, test your config with the `Erlenmeyer` icon to avoid surprises."
        }
    }
}
